// Приемы работы с логическими значениями

// 1. Сделайте функцию, которая параметрами принимает 2 числа.
// Если эти числа равны - пусть функция вернет true, а если не равны - false.

/*function isEqual(n1,n2){
    return n1 == n2;
}

alert(isEqual(5,5));*/


// 2. Сделайте функцию, которая параметрами принимает 2 числа. Если их сумма больше 10 - пусть функция вернет true, а если нет - false.
/*var number1 = 4;
var number2 = 8;

function sumNumbers(n1,n2){
    return n1+n2 > 10;
}

alert(sumNumbers(number1,number2));*/

/*3. Сделайте функцию, которая параметром принимает число и проверяет - отрицательное оно или нет.
    Если отрицательное - пусть функция вернет true, а если нет - false.*/

/*function numberIsTrue(number){
    return number < 0;
}

alert(numberIsTrue(5));*/





