// Задачи на основы работы с пользовательскими функциями в JavaScript

// Задача 1. Сделайте функцию, которая возвращает куб числа. Число передается параметром.

/*function cude(num){
    var res = num * num * num;
    return res;
}*/

// Простые функции

// 1. Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.
/*function sqrt(numer){
    return numer * numer;
}*/

// 2.Сделайте функцию, которая возвращает сумму двух чисел.

/*function sum(num){
    return num+num;
}
console.log(sum(5));*/

// 3. Сделайте функцию, которая отнимает от первого числа второе и делит на третье.

/*function minus_num(a,b,c){
    return (a - b) / c;
}
alert(minus_num(10,5,2));*/

// 4. Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.

/*function imho(num){
   var array = ['пн','вт','ср','чт','пт','сб','вс'];
   return array[num - 1];
}
alert(imho(5));*/


