//TODO Вывести в консоль информацию

//Location {href: "https://tilda.cc/page/?pageid=7570018&projectid=1676398", ancestorOrigins: DOMStringList, origin: "https://tilda.cc",

//"https://tilda.cc/page/?pageid=7570018&projectid=1676398"

//https://tilda.cc/page/?pageid=7570018&projectid=1676398

//TODO Сделать массив из параметров передающихся в адресную строку массив должен содержать имя и значение



//TODO Cделать переход по ссылке на f1.html 3 способами,
// перезагрузку страницы, по истории страниц назад, по истории страниц вперед, перепрыгнуть одну из страниц на следующую.
// информация о браузере пользователя. информация о экране пользователя.